[
  {
    "title": "Artist Connection",
    "image": ["/artistV.png", "/artist.png"],
    "description":  [
                     "This site simulates a social network that allows you to directly contact your local artists. Users can sign up as artists offering their services or as music-lovers looking to contact an artist.", 
                     "Users can book concerts and find the events closest to their location thanks to the geolocation system.",
                     "We incorporated web sockets to build a real-time chat as well as a system to receive notifications while you are online.",
                     "Our project was selected to participate in the Hackshow, organized by Ironhack."
                    ],
    "highlights": ["Geolocation", "Real-Time Chat and Notifications"],
    "githubLink": "https://github.com/orgs/mitte-script-society/repositories",
    "deployLink": "https://artist-connection.netlify.app/",
    "techs": ["React", "MongoDB", "Express", "NodeJS", "Socket.io", "Mongoose", "Tailwind"]
  },
  {
    "title": "Amlo Dice",
    "image": ["/amlodiceV.png", "./amlodice.png"],
    "description":  ["This search engine allows users to find strings within a database of more than 2400 official speeches of the office of the Mexican president.",
                      "It counts the number of repetitions for each year and shows the exact quote in which context it was said.",
                      "Users can download the data about frequent searches in xml or csv, as well as a report with all the quotations of a given string.",
                      "To download the transcripts I use Pupeteer and convert them into a Postgresql database.",
                      "An extra feature I enjoyed developing is my own encryption system to generate unique passwords that validate the requests to the database and expire in about 10 seconds."],
    "highlights": ["Serverless functions", "Encryption System", "Chart JS"],
    "githubLink": "https://github.com/suastech/discursosamlo",  
    "deployLink": "https://amlodice.vercel.app/",
    "techs": ["React", "Prisma", "PostgreSql", "Chart JS", "Puppeteer"]
  },
  {
    "title": "The Points System",
    "image": ["/pointsV.png", "/points.png"],
    "description":  [ "I wanted to apply Next.js and TypeScript in a real project, and I found an opportunity to do it with this joke.",
                      "The Points System rates people's performance in their romantic relationships.",
                      "Just enter your data and it will generate a (not so) scientific report that (not entirely) objectively measures your (extraordinary) qualities as a partner.", "In addition to Next.js, I use the CryptoJS library to create and read the link with the information tailored to each user's request.",
                      "You´re welcome to visit the site and find out your relationship score."
                    ],
    "highlights": [ "It was fun to simulate that the site is hacking your personal data (messages from your ex included) in a retro style"],             
    "githubLink": "https://github.com/suastech/the-points-system",
    "deployLink": "https://the-points-system.netlify.app/",
    "techs": ["Next.js", "TypeScript", "CryptoJS", "Recharts"]
  },
  {
    "title": "Bibliotopía",
    "image": ["/bibliotopiaV.png", "/bibliotopia.png"],
    "description":  [
                      "In 2021 I created Bibliotopía, an independent publisher specializing in social science and philosophy books. This project has led me to translate books from English and French to Spanish, as well as to work with publishers and authors from various countries around the world.",
                     "The site displays the publisher's catalog, the details of each book, and allows users to download the digital version or purchase the printed book.",
                     "Digital PDF files are hosted on Cloudinary"
                ],
    "githubLink": "https://github.com/suastech/bibliotopia",
    "deployLink": "https://bibliotopia.net",
    "techs": ["React", "Cloudinary"]
  },
  {
    "title": "El Terraplanista",
    "image": ["/terraplanistaV.png", "/terraplanista.png"],
    "description":  ["El Terraplanista (literally: The Flat Earther) is a celebration of the triumph of nonsense in politics, journalism and social media.", 
                    "It compiles some of the most hilarious and absurd phrases in Mexican and international politics. (For example, when a Mexican politician said in his campaign: 'Politicians should not steal too much... I hope I don't steal anything').", 
                    "Since 2021, the printed version of this project has been part of the monthly edition of 'El Chamuco', one of the most widely circulated political satire magazines in Mexico.",
                    "This was the first application I published (August 2023). The site is hosted on Github."],
    "githubLink": "https://github.com/suastech/elterraplanista",
    "deployLink": "https://suastech.github.io/elterraplanista/",
    "techs": ["React"]
  },
  {
    "title": "Contracanto",
    "image": ["/contracantoV.png", "/contracanto.png"],
    "description":  ["Contracanto is a choir founded by my brother in a small town in Mexico called Atlacholoaya. It´s a group of talented and brave Mexican teenage girls, who, since 2023, are working hard to make their way to the stages of Mexico and the world.",
                      "On this website you can listen to their music, find out about their upcoming concerts and support them on their journey."],
    "githubLink": "https://github.com/suastech/contracanto",
    "deployLink": "https://suastech.github.io/contracanto/",
    "techs": ["React"]
  }  
]
